/**
 * ⚠️ 【Event Loop】JavaScript执行异步的机制
 * ⚠️ 协调【浏览器 / Node.js】 环境
 * ⚠️ 处理【任务队列】【宏任务 / 微任务】
 * ⚠️ 在【主线程】空闲时执行任务 实现【非阻塞与响应性】
 */

// ⭐️ 事件循环工作原理：
    // 核心组成：
    // 1 调用栈 【 Call Stack 】
    // 2 堆 【 Heap 】
    // 3 任务队列 【 Task Queues 】
    // 4 事件循环本身

// ⭐️ 任务分类：
    // ⚠️ 宏任务 【 Macro Tasks 】
    // （通常每次事件循环处理一个宏任务 颗粒度比较大 也有例外）
    // --- setTimeout() setInterval() DOM事件 I/O操作完成回调 UI渲染

    // ⚠️ 微任务 【 Micro Tasks 】
    // （通常和当前执行任务紧密相关 需要尽快执行 事件循环迭代阶段会执行所有可用的微任务 直到清空队列）
    // --- Promise.then() / .catch() / .finally() queueMicrotask()

// 🚨 事件循环的单轮流程
    // 1 执行同步代码 直到调用栈清空
    // 2 执行所有【微任务】--- 清空
        // 若产生新的微任务 立即添加到末尾 当前阶段执行
    // 3 执行一个宏任务 队列取第一个执行
    // 4 重复上述过程

console.log('1.Start');

setTimeout(function(){
    console.log('4.setTimeout callback (Macro task)');
},0);

Promise.resolve('Promise resolved').then(function(val){
    console.log('3.Promise resolved callback (Micro task):', val);
});

console.log('2.End');

// 1.Start
// 2.End
// 3.Promise resolved callback (Micro task): Promise resolved
// 4.setTimeout callback (Macro task)

// ⚠️ Node.js 中：【 process.nextTick 】-- 优先级高于普通微任务