// ⭐️ this | 一个关键字 一个特殊的对象引用 「运行时」绑定
// 【闭包 => 函数+其词法环境的引用 记住他被「创建时」的作用域】

// 1️⃣ 默认绑定 非严格模式 => window ｜ 严格模式 => undefined
// 2️⃣ 隐式绑定 函数作为对象的一个方法「被调用」｜ 指向调用该方法的对象本身
// 3️⃣ 显式绑定 call / apply / bind
// 4️⃣ new绑定 使用new关键字「调用函数（构造函数）」｜ 指向一个新空对象
// 5️⃣ 特殊功法 箭头函数 => 没有自己的this绑定 ｜ 「定义时」的词法作用域决定 ｜ 一旦绑定不可被call等更改

const obj = {
    name: 'lzk',
    regularFn: function(){
        console.log('1',this.name); 
        const arrowFn1 = ()=>{console.log('2',this.name);};
        // ⚠️ 捕获了 regular 的 this 【捕获「定义时」的环境 而非「调用时」】
        arrowFn1();
    },
    arrowFn2: ()=>{console.log('3',this.name);} // ⚠️ 这里指向全局对象
};
obj.regularFn(); // 1 lzk // 2 lzk
obj.arrowFn2(); // 3 undefined

// 6️⃣ setTimeout 中的 this

const obj2 = {
    name: 'MyTimer',
    start1() { // ⚠️ 等价于 start1: function() {...}
        // 🟢 作为对象的方法：函数start1 的this指向调用者obj2
        // 🟢 但 setTimeout 里的回调函数是「普通函数（非箭头函数）」 它的this丢失了上下文 默认绑定全局对象
        setTimeout(function(){
            console.log('1',this.name);
        },300);
    },
    start2() {
        // 🟢 箭头函数this永远取决于定义时的外层作用域（词法作用域）不会被调用方式影响
        // 🟢 【解决回调函数this丢失问题的最佳实践】
        setTimeout(()=>{
            console.log('2',this.name);
        },500);
    },
};
obj2.start1(); // 1 undefined
obj2.start2(); // 2 MyTimer